In [59]:
import numpy   as np
import pandas  as pd
import pickle  as pkl
from sklearn.model_selection import train_test_split
from sklearn.ensemble        import RandomForestClassifier
from sklearn.preprocessing   import LabelEncoder
from sklearn.metrics         import precision_score,recall_score,accuracy_score

In [23]:
df = pd.read_csv("./DATA/TITANIC/train.csv")

In [28]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [29]:
df.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [30]:
df = df[[ 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp',
       'Parch', 'Fare', 'Embarked']]

In [31]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [32]:
df.shape

(891, 8)

In [33]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [34]:
df = df.dropna()

In [35]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [37]:
X.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [39]:
labelencoder = LabelEncoder()

In [40]:
df['Sex'] = labelencoder.fit_transform(df['Sex'])

In [41]:
df['Embarked'] = labelencoder.fit_transform(df['Embarked'])

In [42]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [46]:
X = df.drop("Survived",axis=1)
y = df['Survived']
X = np.array(X)
y = np.array(y)

In [47]:
x_train,x_test,y_train,y_test = train_test_split(X,y)

In [48]:
model = RandomForestClassifier(max_depth=1000).fit(x_train,y_train)

In [50]:
y_pred = model.predict(x_test)

In [51]:
result_analysis = pd.DataFrame({'ytest':y_test,'ypred':y_pred})

In [52]:
result_analysis

     ytest  ypred
0        0      0
1        1      1
2        1      1
3        0      0
4        1      1
..     ...    ...
173      1      1
174      0      1
175      0      0
176      1      0
177      0      0

[178 rows x 2 columns]

In [57]:
def custom_metrics(y_test,y_pred):
    result = {}
    acc    = accuracy_score(y_test,y_pred)
    prec   = precision_score(y_test,y_pred)
    recall = recall_score(y_test,y_pred)
    result['acc'] = acc
    result['prec'] = prec
    result['recall'] = recall
    
    return result

In [58]:
custom_metrics(y_test,y_pred)

{'acc': 0.7584269662921348,
 'prec': 0.6865671641791045,
 'recall': 0.6764705882352942}

In [62]:
## serializer with pickle
pkl.dump(model,open("MODEL/model1.pkl",'wb'))